Revit 2027 API
View.CreateViewTemplate Method
 Creates a new view template instance from this view instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public View CreateViewTemplate()
Public Function CreateViewTemplate As View
public:
View^ CreateViewTemplate()
member CreateViewTemplate : unit -> View
Return Value
View
 New view template instance
Exceptions
Exception | Condition
InvalidOperationException |  The view is not valid for view template creation.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace